Revit 2027 API
ViewPlanType Enumeration
An enumerated type listing plan view types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ViewPlanType
Public Enumeration ViewPlanType
public enum class ViewPlanType
type ViewPlanType
Members
Member name | Value | Description
CeilingPlan | 2 | Reflected ceiling plan view.
FloorPlan | 1 | Floor plan view.
See Also
Reference
Autodesk.Revit.DB Namespace